[
  {
    "name": "SK-II",
    "imageKey": "brand0",
    "price": "$99",
    "description": "A luxurious essence enriched with Pitera to transform skin’s texture, radiance, and firmness with daily use."
  },
  {
    "name": "Kiehl's",
    "imageKey": "brand1",
    "price": "$40",
    "description": "Natural, apothecary-based skincare solutions that deeply nourish and rejuvenate all skin types effectively and gently."
  },
  {
    "name": "Origins",
    "imageKey": "brand2",
    "price": "$48",
    "description": "Powered by nature and proven by science, Origins creates effective skincare with natural and organic ingredients."
  },
  {
    "name": "NARS Cosmetics",
    "imageKey": "brand3",
    "price": "$32",
    "description": "Bold, high-performance makeup that empowers creativity and celebrates self-expression with iconic color collections."
  },
  {
    "name": "bareMinerals",
    "imageKey": "brand4",
    "price": "$30",
    "description": "Clean, mineral-based beauty products that promote healthier skin while offering beautiful, natural-looking coverage."
  },
  {
    "name": "Murad",
    "imageKey": "brand5",
    "price": "$72",
    "description": "Doctor-developed skincare that targets acne, aging, and hydration issues with powerful yet gentle solutions."
  },
  {
    "name": "Colorbar Timeless Lift Miracle Lifting Day Crème",
    "imageKey": "brand6",
    "price": "$65",
    "description": "A luxurious anti-aging cream that firms, lifts, and hydrates skin, leaving it smoother, radiant, and youthful all day."
  },
  {
    "name": "Ruby's Organics Skin Tint Foundation",
    "imageKey": "brand7",
    "price": "$38",
    "description": "A lightweight, plant-based foundation that hydrates, evens skin tone, and provides a soft, natural matte finish."
  },
  {
    "name": "Maybelline New York Fit Me Matte+Poreless Powder",
    "imageKey": "brand8",
    "price": "$15",
    "description": "An oil-absorbing, pore-blurring powder delivering a smooth, natural matte finish for normal to oily skin types."
  }
]
